Revit 2027 API
DocumentValidation Class
 Utility functions with document validation
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DocumentValidation
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class DocumentValidation
Public NotInheritable Class DocumentValidation
public ref class DocumentValidation abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type DocumentValidation = class end
The DocumentValidation type exposes the following members.
Methods
Name | Description
CanDeleteElement |  Indicates if an element can be deleted.
Top
See Also
Reference
Autodesk.Revit.DB Namespace